[
  {
    "Title": "Data Structures summary",
    "Codes": [
      {
        "Nr": 1,
        "CodeFormat": "Data Source: hard coded in program (eg. status messages), input from UI, web API -> data collection -> data structure"
      },
      {
        "Nr": 2,
        "CodeFormat": "list -> Array or Sets, key/value pairs -> Objects or Maps"
      },
      {
        "Nr": 3,
        "CodeFormat": "Use Arrays for ordered value lists that might contain duplicates, or to manipulate data as it has many methods."
      },
      {
        "Nr": 4,
        "CodeFormat": "Use Sets for unique values and for high preformance, or to remove duplicates from arrays."
      },
      {
        "Nr": 5,
        "CodeFormat": "Use Objects when you need methods. Use with JSON."
      },
      {
        "Nr": 6,
        "CodeFormat": "Use Map when you need to map key to values. Use when keys are not strings."
      }
    ]
  },
  {
    "Title": "Strings",
    "Codes": [
      {
        "Nr": 7,
        "CodeFormat": "methods are case sensitive"
      }
    ]
  },
  {
    "Title": "Part 16, Functions",
    "Codes": [
      {
        "Nr": 8,
        "CodeFormat": "Default Parameters."
      },
      {
        "Nr": 9,
        "CodeFormat": "Passing arguments, Value/Reference.<br>Primitives by value. Objects by reference.<br>Primitives arguments cant change their outside value in function. Objects can."
      },
      {
        "Nr": 10,
        "CodeFormat": "First class functions. Meaning Functions are values and objects.<br>Functions can be stored in variables or properties, passed as arguments to functions, returned from functions, have methods."
      },
      {
        "Nr": 11,
        "CodeFormat": "Higher order functions. Function that recives function as argument, that returns new function or both."
      },
      {
        "Nr": 12,
        "CodeFormat": "Callback functions passed to functions allow for levels of abstraction. Callback is lower level. Function calling them is higher level of abstraction delegating some computations to callback."
      },
      {
        "Nr": 13,
        "CodeFormat": "Call and applay methods.<br>Method can be stored in variable as function.<br>This to object on witch it is called is provided as argument of call function along with rest of the params.<br>Bind returns function with this set."
      },
      {
        "Nr": 14,
        "CodeFormat": "Bind can be used to bind function to object in event handlers, becouse this is pointing to DOM element by default in addEvent methods."
      }
    ]
  }
]
